fabrika/src/Catalogs/БанковскиеСчета/БанковскиеСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БанковскиеСчета</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Организации</owners>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>НомерСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>БИК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоррСчет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.КлассификаторБанковРФ</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокПредставления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fabrika/src/Catalogs/БанковскиеСчета/Forms/ФормаЭлемента/Module.bsl
//////////////////////////////////////ОБРАБОТКА СОБЫТИЙ ФОРМ//////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Владелец.ВалютныйРассчёт Тогда
		Элементы.БИК.Заголовок = "Swift";
	КонецЕсли;	
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	БанковскиеСчета.Ссылка
	               |ИЗ
	               |	Справочник.БанковскиеСчета КАК БанковскиеСчета
	               |ГДЕ
	               |	БанковскиеСчета.Ссылка <> &ТекущийОбъект
	               |	И БанковскиеСчета.НомерСчета = &НомерСчета
	               |	И БанковскиеСчета.Владелец = &Владелец
	               |	И БанковскиеСчета.Валюта = &Валюта";
				   
	Запрос.УстановитьПараметр("НомерСчета", ТекущийОбъект.НомерСчета);			   
	Запрос.УстановитьПараметр("Владелец", ТекущийОбъект.Владелец);			   
	Запрос.УстановитьПараметр("Валюта", ТекущийОбъект.Валюта);
	Запрос.УстановитьПараметр("ТекущийОбъект", ТекущийОбъект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Счёт с такими реквизитами уже существует!!!", Выборка.Ссылка);
	КонецЦикла;	
	
	
	
КонецПроцедуры
//////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////







&НаКлиенте
Процедура БИКПриИзменении(Элемент)
	БИКПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура БИКПриИзмененииНаСервере()
	
	Банк = Справочники.КлассификаторБанковРФ.НайтиПоКоду(Объект.БИК);
	
	Объект.КоррСчет = Банк.КоррСчет;
	Объект.Банк = Банк;
	Объект.Наименование = Банк.Наименование;
	
КонецПроцедуры
